app/controllers/listings_controller.rb

INSERT INTO "listings" ("created_at", "name", "price", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Thu, 10 Apr 2014 14:44:49 UTC +00:00], ["name", "Jason's House"], ["price", #<BigDecimal:104589cd8,'0.9238E4',9(18)>], ["updated_at", Thu, 10 Apr 2014 14:44:49 UTC +00:00]]
---
  def create
    @listing = Listing.new(listing_params)

    respond_to do |format|
      if @listing.save